{
  "backend/main.mo": "Motoko canister managing user profiles, roles, lawyer directory data, and bookings with access control enforcement.",
  "feature_evidence.json": "Feature evidence report mapping implemented features to source files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten file summaries describing the purpose of each frontend file for reference or build tooling.",
  "frontend/index.css": "Tailwind base styles defining an OKLCH color theme with light/dark variables and global element styling.",
  "frontend/index.html": "Base HTML file mounting the React app and loading the main TypeScript entry point.",
  "frontend/src/App.tsx": "Main React router configuration defining public, authenticated, and role-protected routes with layouts.",
  "frontend/src/components/auth/RequireAuth.tsx": "Auth guard redirecting unauthenticated users to home and showing a loader during Internet Identity init.",
  "frontend/src/components/auth/RequireRole.tsx": "Role-based guard that redirects users without matching roles and displays an Access Denied fallback.",
  "frontend/src/components/layout/AppLayout.tsx": "Authenticated layout that ensures user profile and onboarding completion before rendering content.",
  "frontend/src/components/layout/PublicLayout.tsx": "Public-facing layout with header, footer, and routed main content area.",
  "frontend/src/components/nav/PublicFooter.tsx": "Footer with navigation links for clients, lawyers, and company info plus dynamic copyright text.",
  "frontend/src/components/nav/PublicHeader.tsx": "Responsive header with navigation links and Internet Identity login/logout handling.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context with login, logout, stored identity loading, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for user profiles, onboarding, lawyer search, dashboards, bookings, and status updates using the actor API.",
  "frontend/src/index.css": "Tailwind base styles plus custom CSS variables for theming and light/dark mode support.",
  "frontend/src/main.tsx": "App entry point setting up React Query and Internet Identity providers before rendering App.",
  "frontend/src/pages/auth/OnboardingRole.tsx": "Role selection page that loads the user profile, handles onboarding completion, and routes to the appropriate dashboard.",
  "frontend/src/pages/auth/ProfileSetup.tsx": "Displays a profile setup form, handles saving the user's name, and redirects if a profile already exists.",
  "frontend/src/pages/booking/BookConsultation.tsx": "Lets users select a lawyer, choose a date and time, and book a consultation with validation and navigation.",
  "frontend/src/pages/chat/Chat.tsx": "Shows a placeholder chat interface indicating messaging features are coming soon.",
  "frontend/src/pages/dashboard/ClientDashboard.tsx": "Displays client dashboard with upcoming consultations, saved lawyers, and tabbed sections for chat, payments, and documents.",
  "frontend/src/pages/dashboard/LawyerDashboard.tsx": "Shows lawyer dashboard with booking stats, earnings, ratings, and profile-related metrics.",
  "frontend/src/pages/directory/FindLawyers.tsx": "Provides a searchable and filterable directory of lawyers sorted by status and rating.",
  "frontend/src/pages/lawyers/JoinAsLawyer.tsx": "Form page allowing authenticated users to create a lawyer profile with fields for bio, expertise, languages, and credentials. Handles validation, dynamic list fields, and submission via createProfile mutation.",
  "frontend/src/pages/lawyers/LawyerProfile.tsx": "Displays a lawyer’s full profile with reviews, ratings, and booking history checks. Supports submitting new reviews and navigating back to the directory.",
  "frontend/src/pages/marketing/Home.tsx": "Marketing homepage with hero, feature explanations, and calls to action for finding lawyers or joining as one. Uses cards and visuals to present how the platform works.",
  "frontend/src/pages/subscriptions/ClientPlans.tsx": "Shows subscription tiers for clients with pricing and feature lists. Provides buttons for starting or selecting a plan.",
  "frontend/src/pages/subscriptions/LawyerPlans.tsx": "Displays subscription plans for lawyers, detailing features for Basic and Pro tiers. Includes pricing and upgrade or signup actions.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading URL parameters, storing/retrieving them in sessionStorage, and cleaning parameters from the URL hash.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS with custom colors, typography, container settings, animations, and extended theme tokens for the frontend.",
  "project_state.json": "Defines project metadata, current state, features, versioning, and required images for the LawConnect SaaS platform."
}